Revit 2027 API
WallSweepInfo.ProfileId Property
 The element id of the profile family used to create the sweep or reveal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProfileId { get; set; }
Public Property ProfileId As ElementId
	Get
	Set
public:
property ElementId^ ProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ProfileId : ElementId with get, set
Property Value
ElementId
 May be InvalidElementId if the default profile is used.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This value is not used when creating standalone wall sweeps. The profile id of the wall sweep's type is used instead.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace